{
  "all": [
    {
      "name": "Block",
      "features": [
        {
          "name": "Crop Interact",
          "desc": "Right-Clicking on crops will do all the work of harvesting for you!! Right clicking (empty hand or not!) will earn you not only the original drop of the crop, but even some of the bonus seeds that you'd normally get (minus one, of course, to account for what's been re-planted for you). Works with most plantables, assuming they follow similar code to Vanilla.",
          "img": "/img/vtweaks/screenshots/crop_harvesting.gif",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Cake Drop",
          "desc": "Breaking a completely un-eaten cake will drop itself. Finally you can have your cake and eat it too!",
          "img": "/img/vtweaks/screenshots/cake_drop.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Tree Falling",
          "desc": "Trees actually fall down when breaking their trunk, based off of Tersnip's ChopDown Mod!",
          "img": "/img/vtweaks/screenshots/tree_falling.gif",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Torch Lighing",
          "desc": "Right-clicking a torch (or anything tagged `#vtweaks:ignition_item`) onto any block which can be lit (furnaces, redstone ore, campfires and anything not tagged `#vtweaks:torch_ignition_blacklist`) will ignite it!",
          "img": "/img/vtweaks/screenshots/torch_lighting.gif",
          "versions": [
            "1.19.2"
          ]
        }
      ]
    },
    {
      "name": "Item",
      "features": [
        {
          "name": "Durability Tooltips",
          "desc": "Shows durability of items on item hover",
          "img": "/img/vtweaks/screenshots/durability_tooltip.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Food Tooltips",
          "desc": "Shows food hunger & saturation on item hover",
          "img": "/img/vtweaks/screenshots/food_tooltip.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Cactus Item Protection",
          "desc": "Cactus destroying items doesn't really make sense. Enabling this prevents cactus from destroying items that run into it.",
          "img": "/img/vtweaks/screenshots/cactus_item_tweak.jpg",
          "versions": [
            "1.19.2"
          ]
        }
      ]
    },
    {
      "name": "Entity",
      "features": [
        {
          "name": "Challenger Mobs",
          "desc": "Challenger Mobs are an insanely customizable data-driven approach to boss-like mobs. See its dedicated Datapack Page using the submenu above to learn more about customzing this feature!",
          "img": "/img/vtweaks/screenshots/challengers.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Feather Pluck",
          "desc": "Pluck feathers off of chickens with shears! There is a cool-down of approximately 5 minutes, but it doesn't hurt the chicken even though it looks like it does!",
          "img": "/img/vtweaks/screenshots/plucking.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Entity Culling",
          "desc": "V-Tweaks offers a very powerful data-driven tool for allow you to disable specific mobs (or `entity_type` tag) from spawning in a particular dimension, biome or biome tag! See its dedicated Datapack Page using the submenu above to learn more about customzing this feature!",
          "img": "/img/vtweaks/screenshots/mob_disabler.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Peaceful Surface",
          "desc": "Prevents mobs spawning above sea level (configurable) on most nights, preventing you from having to deal with all the monsters. Only on new moons will mobs spawn on the surface, but you can otherwise find them in caves like usual. You can prevent certain mob spawns from being affected by this by using the `vtweaks:ignored_by_peaceful_surface` `entity_type` tag. You can control this feature in specific dimensions using the `vtweaks:peaceful_surface_blacklist_dims` tag.",
          "img": "/img/vtweaks/screenshots/peaceful_surface.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Smaller Bees",
          "desc": "This tweak makes it so that bees appear to be smaller (exactly half their size, actually!). Logistically this changes nothing about them - their bounding and hit box is the same for your convenience, but they're sooo cute!",
          "img": "/img/vtweaks/screenshots/smol_bees.jpg",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Pet Friendly Fire",
          "desc": "This tweak prevents pet owners (or all players - this is configurable) from hurting tamed pets so that you can keep your special friend alive and healthy!",
          "img": "/img/vtweaks/screenshots/pet_ff.gif",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Griefless Creepers",
          "desc": "When enabled, any explosion caused by a `#forge:creeper` (`entity_type`) will restore itself after time, even restoring Tile Entities and their data stored within!",
          "img": "/img/vtweaks/screenshots/ungreifed_creepers.gif",
          "versions": [
            "1.19.2"
          ]
        }
      ]
    },
    {
      "name": "Player",
      "features": [
        {
          "name": "Corpse Drops",
          "desc": "The item despawn mechanic is really unfair when you die, isn't it? By enabling this tweak items dropped by players on death will never despawn!",
          "img": "/img/vtweaks/screenshots/despawn.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Better Feather Falling",
          "desc": "If you have a pair of boots with Feather Falling IV on them, all fall damage is negated. The damage you would have taken (literally - the amount of half-hearts you would have taken) is then applied to directly to your boots instead.",
          "img": "/img/vtweaks/screenshots/featherfalling.gif",
          "versions": [
            "1.19.2"
          ]
        }
      ]
    },
    {
      "name": "Recipes",
      "features": [
        {
          "name": "Anvil Recipes",
          "desc": "Create custom anvil recipes using a datapack! See its dedicated Datapack Page using the submenu above to learn more about customzing this feature!",
          "img": "/img/vtweaks/screenshots/datapack_anvil_recipes.png",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Fluid Conversion Recipes",
          "desc": "Convert one item to another by throwing it into some fluid (now with JEI integration!). By default, V-Tweaks includes a set of recipes for converting Concrete Powder to Concrete, but check its dedicated Datapack Page using the submenu above to learn more about customzing this feature!",
          "img": "/img/vtweaks/screenshots/concrete_tweaks.gif",
          "versions": [
            "1.19.2"
          ]
        },
        {
          "name": "Item Repair",
          "desc": "Sets the repair costs of tools to a fixed 1XP, making it so you can keep your tools forever!",
          "img": "/img/vtweaks/screenshots/anvil_repair_cost.png",
          "versions": [
            "1.19.2"
          ]
        }
      ]
    },
    {
      "name": "World",
      "features": [
        {
          "name": "Disable Storms",
          "desc": "Completely disable thunderstorms, converting them all to normal rain on the fly!",
          "img": "/img/vtweaks/screenshots/thunder_storms.png",
          "versions": [
            "1.19.2"
          ]
        }
      ]
    }
  ]
}